In [2]:
import pandas as pd

In [5]:
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/LXjSAttmoxJfEG6il1Bqfw/Product-sales.csv"
df = pd.read_csv(filename)

In [6]:
df

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [7]:
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [8]:
# Read data from Excel File and print the first five rows

xlsx_path = 'Product-sales.xlsx'
df = pd.read_excel(xlsx_path)

In [9]:
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [10]:
x = df[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [11]:
x = df['Product']

In [12]:
x

0        Laptop
1    Smartphone
2    Desk Chair
3      Notebook
4       Monitor
Name: Product, dtype: object

In [13]:
x = df[['Quantity']]
type(x)

pandas.core.frame.DataFrame

In [14]:
y = df[['Product', 'Category', 'Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1

In [15]:
df.iloc[0,0]

np.int64(1)

In [16]:
df.iloc[1,0]

np.int64(2)

In [17]:
df.iloc[0,2]

'Electronics'

In [20]:
df.iloc[2,2]

'Furniture'

In [21]:
df.loc[1,'Product']

'Smartphone'

In [22]:
df.loc[1,'CustomerCity']

'Los Angeles'

In [23]:
df.iloc[0:2,0:3]

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics

In [24]:
df.loc[0:2, 'OrderID':'Category']

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics
2        3  Desk Chair    Furniture

In [25]:
new_index=['a','b','c','d','e']
df_new=df
df_new.index=new_index
df_new

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
a,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
b,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
c,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
d,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
e,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [26]:
df_new.loc['a', 'CustomerCity']

'New York'